views/layouts/login.php

SELECT * FROM `tbl_settings` WHERE field = 'loginpage_logo'
SELECT * FROM `tbl_settings` WHERE field = 'custom_logo_name'
---
use app\components\IsataskFooter;
LoginAsset::register($this);

$logo = Settings::find()->where("field = 'loginpage_logo'")->one()->fieldimage;

$logo_name = Settings::find()->where("field = 'custom_logo_name'")->one()->fieldvalue;