controllers/SiteController.php

SELECT * FROM `tbl_settings` WHERE field = 'project_sort'
---
    public function actionIndex(){
		//echo (new User())->decryptPassword("ZLv5AY+xaObf8yH7vw2RWSQ5ZX0Y1NsjBMRfE49VkRo=");die;
		$user_id = Yii::$app->user->identity->id;

		$roleId = Yii::$app->user->identity->role_id;

    	$this->layout = 'main';

    	$stats=array(array('id'=>2,'name'=>'Pending Tasks'),array('id'=>3,'name'=>'Working Tasks'),array('id'=>4,'name'=>'Working ToDos'),array('id'=>1,'name'=>'Not Started Tasks'));
    	$casearrayDataProvider =new ArrayDataProvider([
			'allModels' => $stats,
		]);

    	$stats=array(array('id'=>'teamassignment_2','name'=>'Pending Tasks'),array('id'=>'teamassignment_3','name'=>'Working Tasks'),array('id'=>'teamassignment_4','name'=>'Working ToDos'),array('id'=>'teamassignment_1','name'=>'Not Started Tasks'));

		$TeamarrayDataProvider = new ArrayDataProvider(['allModels' => $stats]);
		// Start: My Case / My Team Assignments By Status
		$userId = $user_id;
		$sqlclients = "SELECT tbl_project_security.client_case_id FROM tbl_project_security WHERE tbl_project_security.user_id= :userId and tbl_project_security.client_case_id!=0 group by tbl_project_security.client_case_id";
    	$sqlteams = "SELECT tbl_project_security.team_id FROM tbl_project_security WHERE tbl_project_security.user_id=".$userId." and tbl_project_security.team_id=1 group by tbl_project_security.team_id";
		$where = ""; $select = ""; $join = "";$order="";
		$settings_info = Settings::find()->where("field = 'project_sort'")->one();

SELECT `fieldtext` FROM `tbl_settings` WHERE `field`='loginpage'
SELECT `fieldtext` FROM `tbl_settings` WHERE `field`='loginpage_bottom'
SELECT `id` FROM `tbl_settings` WHERE `field`='active_dir'
---
			return $this->redirect($redirect_method);
        }

        $Settingdata = Settings::find()->select(['fieldtext'])->where(['field'=>'loginpage'])->one();
        $Settingdatabottom = Settings::find()->select(['fieldtext'])->where(['field'=>'loginpage_bottom'])->one();
        $SettingLdap = Settings::find()->select(['id'])->where(['field'=>'active_dir'])->one();