controllers/SystemController.php

    public function actionProjectsort(){
    	$model = new Settings();
    	$data = Settings::find()->where(['field'=>'project_sort'])->one();
    	if(isset($data->id) && $data->id!== null)
    		$model = Settings::findOne($data->id);
---
SELECT * FROM `tbl_settings` WHERE `field`='project_sort'
SELECT * FROM `tbl_settings` WHERE `id`=4

    public function actionLdapconfig() {
    	$model = new Settings();
    	$model->scenario = 'ldapconfig';
    	$data = Settings::find()->where(['field'=>'active_dir'])->one();
    	$json_data = array();
    	if(isset($data->id) && $data->id!== null) {
    		$json_data = json_decode($data->fieldvalue,true);
    	}
    	$user_filter = ArrayHelper::map(SettingsAdFilters::find()->select(['name','filter'])->where(['filter_type'=>2])->all(), 'filter','name');
    	$group_filter = ArrayHelper::map(SettingsAdFilters::find()->select(['name','filter'])->where(['filter_type'=>1])->all(), 'filter','name');
---
SELECT * FROM `tbl_settings` WHERE `field`='active_dir'
SELECT `name`, `filter` FROM `tbl_settings_ad_filters` WHERE `filter_type`=2
SELECT `name`, `filter` FROM `tbl_settings_ad_filters` WHERE `filter_type`=1