components/AdminLeftPanel.php

SELECT * FROM `tbl_role` WHERE `id`=1
---
	public function run()
	{
		$roleId = Yii::$app->user->identity->role_id;
		$roleInfo = Role::findOne($roleId);