models/Servicetask.php

    public function beforeInsert()
    {
    	$last = $this->find()->where(['teamservice_id'=>$this->teamservice_id])->orderBy([$this->orderAttribute => SORT_DESC])->limit(1)->one();
    	if ($last === null) {
    		$this->{$this->orderAttribute} = 1;
    	} else {
    		$this->{$this->orderAttribute} = $last->{$this->orderAttribute} + 1;
---
SELECT * FROM `tbl_teamservice` WHERE `id`=2