models/Settings.php

	public static function setLogo() {
        $logo_data = Settings::find()->select(['fieldimage'])->where("field = 'modulepage_logo'")->one();
---
SELECT `fieldimage` FROM `tbl_settings` WHERE field = 'modulepage_logo'

	public static function setCustomversion() {
        $_SESSION['custom_version'] = Settings::find()->select(['fieldvalue'])->where(['field' =>'custom_version'])->one();
---
SELECT `fieldvalue` FROM `tbl_settings` WHERE `field`='custom_version'