models/User.php

    public function getTableFieldLimit($table){
		//$friendsArray2 = '"' . join('","',$select_fields) . '"';
		$field_type_list = ArrayHelper::map(ReportsFields::find()->joinWith('reportsFieldType')
			->where("report_table_id IN(select id from tbl_reports_tables where table_name ='".$table."')")->all(), 'field_name', function($model){
		  if(isset($model->length_value) && $model->length_value!="")
			   return $model->length_value;
		  else
			   return '';
		});
---
SELECT `tbl_reports_fields`.* FROM `tbl_reports_fields` LEFT JOIN `tbl_reports_field_type` ON `tbl_reports_fields`.`reports_field_type_id` = `tbl_reports_field_type`.`id` WHERE report_table_id IN(select id from tbl_reports_tables where table_name ='tbl_user')